In [62]:
import pandas as pd

In [63]:
a=pd.Series(["Sita","Rita","Ram","Hari"])
b=pd.Series([1000,2500,4000,2200])

In [64]:
df=pd.DataFrame({"Name":a,"Salary":b})

In [65]:
df.columns

Index(['Name', 'Salary'], dtype='object')

In [66]:
df

   Name  Salary
0  Sita    1000
1  Rita    2500
2   Ram    4000
3  Hari    2200

## Indexing

In [67]:
df[["Name"]]

   Name
0  Sita
1  Rita
2   Ram
3  Hari

In [68]:
df.loc[1:3,"Name":"Salary"]

   Name  Salary
1  Rita    2500
2   Ram    4000
3  Hari    2200

In [69]:
#location (inclusive)
df.loc[1,"Name"]

'Rita'

In [70]:
# Integer location (exclusive)
df.iloc[1:3,0]

1    Rita
2     Ram
Name: Name, dtype: object

In [71]:
df.iloc[2:4,0:2]

   Name  Salary
2   Ram    4000
3  Hari    2200

In [75]:
df.iloc[2,1]

4000